{
  "division": "Product and Service Enabling",
  "domain": "Financial Instrument Management",
  "capability": {
    "name": "Financial Instrument Reference Data Management",
    "definition": "This Service Domain maintains a directory of financial instrument reference data",
    "role": "Maintain a central reference directory of market traded asset/instrument details. The details are typically captured from one or more specialist market feeds that publish market asset/instrument details. It can include the result of internal reference data processing",
    "example": "A corporate financial advisory project references different instrument specifications when assembling a structured financial approach to the customer financing needs",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN3/FinancialInstrumentReferenceDataManagement/12.0.0",
    "key_features": [
      {
        "name": "Consolidate reference data from market sources",
        "description": "Enables consolidate reference data from market sources to support this service domain maintains a directory of financial instrument reference data",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Classify and verify reference data",
        "description": "Enables classify and verify reference data to support this service domain maintains a directory of financial instrument reference data",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Organize reference data for ease of access",
        "description": "Enables organize reference data for ease of access to support this service domain maintains a directory of financial instrument reference data",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Provide access to instrument reference data",
        "description": "Enables provide access to instrument reference data to support this service domain maintains a directory of financial instrument reference data",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}