{
  "division": "Enterprise Management and Controlling",
  "domain": "Policy Management",
  "capability": {
    "name": "Internal Audit",
    "definition": "Maintain and portfolio of internal audit checks. Select and execute a meaningful sample of checks and identify and resolve non-compliance",
    "role": "This service domain administers the scheduled and ad-hoc application of internal audit and compliance reviews. This includes interpreting the banks policies and procedures that guide all aspects the bank's operations and determining which guidelines apply in specific circumstances across the enterprise. Support for interpreting guidelines are provided to activities in the bank that are subject to audit and scheduled and ad-hoc checks performed to confirm compliance",
    "example": "A periodic audit of a processing unit is undertaken and remedial corrections to procedures recommended to improve compliance",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN-3/InternalAudit/12.0.0",
    "key_features": [
      {
        "name": "Schedule/target internal audit reviews",
        "description": "Enables schedule/target internal audit reviews to support maintain and portfolio of internal audit checks",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Consolidate documents/activity pertaining to the audit",
        "description": "Enables consolidate documents/activity pertaining to the audit to support maintain and portfolio of internal audit checks",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Provide advice/guidance for achieving guideline/policy compliance",
        "description": "Enables provide advice/guidance for achieving guideline/policy compliance to support maintain and portfolio of internal audit checks",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Evaluate and report on activity for regulatory compliance",
        "description": "Enables evaluate and report on activity for regulatory compliance to support maintain and portfolio of internal audit checks",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Notify and track responses for detected procedural failures",
        "description": "Enables notify and track responses for detected procedural failures to support maintain and portfolio of internal audit checks",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}