{
  "division": "Enterprise Management and Controlling",
  "domain": "Policy Management",
  "capability": {
    "name": "It Standards And Guidelines",
    "definition": "Define and apply comprehensive IT architectures, policies and standards as appropriate. Also define the IT usage guidelines and procedures governing systems use across the enterprise",
    "role": "Develop, maintain and enforce IT architectures, systems related policies and standards as appropriate. Select from industry standards, commercially available development and production environments, infrastructure platforms, systems development and deployment tooling and IT utilities/libraries. Define the IT acquisition, development, maintenance and usage guidelines and policies governing systems development and production use across the enterprise",
    "example": "A review of available IT tooling is performed to identify recommended tooling for application development",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN-3/ITStandardsAndGuidelines/12.0.0",
    "key_features": [
      {
        "name": "Define IT Policies and Guidelines",
        "description": "Enables define it policies and guidelines to support define and apply comprehensive it architectures, policies and standards as appropriate",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Select and apply IT standards",
        "description": "Enables select and apply it standards to support define and apply comprehensive it architectures, policies and standards as appropriate",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Select technology platforms and technology for development and production",
        "description": "Enables select technology platforms and technology for development and production to support define and apply comprehensive it architectures, policies and standards as appropriate",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Select preferred IT tools and utilities for development and production",
        "description": "Enables select preferred it tools and utilities for development and production to support define and apply comprehensive it architectures, policies and standards as appropriate",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}