{
  "division": "Marketing and Sales",
  "domain": "Sales Plan Management",
  "capability": {
    "name": "Business Development",
    "definition": "Define, implement, track and assess the new business development plans",
    "role": "Define, implement, track and assess the new business development plans for the enterprise or specific business divisions. This can cover business activities such as new market segment entry, product coverage and product specification development, brand development, new customer acquisition and existing customer, cross-sell/up-sell and retention.",
    "example": "Corporate strategy develops targets for new business acquisition in selected market segments",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN-3/BusinessDevelopment/12.0.0",
    "key_features": [
      {
        "name": "Define governing policies and guidelines",
        "description": "Enables define governing policies and guidelines to support define, implement, track and assess the new business development plans",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Define business goals",
        "description": "Enables define business goals to support define, implement, track and assess the new business development plans",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Define supporting business development strategies",
        "description": "Enables define supporting business development strategies to support define, implement, track and assess the new business development plans",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Track progress towards goals and direct activity",
        "description": "Enables track progress towards goals and direct activity to support define, implement, track and assess the new business development plans",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}