{
  "division": "Customer and Distribution",
  "domain": "Customer Management",
  "capability": {
    "name": "Customer Access Entitlement",
    "definition": "This service domain maintains the details of the allowed channel/device based access to products and services that the customer has in place. This profile is referenced in servicing and fulfillment activity and may include customer preferences and access limits/constraints that span multiple products.",
    "role": "This profile is used for servicing and fulfillment controls covering products, services and channel/device usage entitlements. It is referenced for channel access control and utilization limits that may span multiple products. For example there can be a limit on total ATM withdrawals for a customer for all active products over a 24 hour period.",
    "example": "A consumer customer contacts the call center and her access profile is used to determine what products and services can be accessed through this channel",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "",
    "key_features": [
      {
        "name": "Maintain customers' channel/device access profiles (allowed uses and limits)",
        "description": "Enables maintain customers' channel/device access profiles (allowed uses and limits) to support this service domain maintains the details of the allowed channel/device based access to products and services that the customer has in place",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Maintain customers' channel/device usage preferences",
        "description": "Enables maintain customers' channel/device usage preferences to support this service domain maintains the details of the allowed channel/device based access to products and services that the customer has in place",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Check/confirm allowed access for customer contacts",
        "description": "Enables check/confirm allowed access for customer contacts to support this service domain maintains the details of the allowed channel/device based access to products and services that the customer has in place",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}