{
  "division": "Product and Service Enabling",
  "domain": "Agreement Management",
  "capability": {
    "name": "Customer Billing",
    "definition": "This service domains provides a central service to compose, issue and track customer billing and invoices",
    "role": "This service domain provides a general customer billing service. The service domain is provided with the applicable fees and charges that are authorized for invoicing typically by a product or service fulfillment service domain. Processing can include verification and authorizations steps and the invoice could be issued as a single transaction or a schedule of transactions.",
    "example": "An invoice is raised for the fees and commissions applicable to a managed investment portfolio",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN-3/CustomerBilling/12.0.0",
    "key_features": [
      {
        "name": "Process/issue customer invoices (on request from fulfillment)",
        "description": "Enables process/issue customer invoices (on request from fulfillment) to support this service domains provides a central service to compose, issue and track customer billing and invoices",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Issue reminders against unpaid invoices",
        "description": "Enables issue reminders against unpaid invoices to support this service domains provides a central service to compose, issue and track customer billing and invoices",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Track and report on customer payments against invoices",
        "description": "Enables track and report on customer payments against invoices to support this service domains provides a central service to compose, issue and track customer billing and invoices",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}