{
  "division": "Marketing and Sales",
  "domain": "Campaign Management",
  "capability": {
    "name": "Prospect Campaign Design",
    "definition": "Design and refine prospect campaign specifications based on their impact",
    "role": "This Service Domain designs and refines prospect campaigns (or integrates designs from external campaign specialists). Prospect campaigns target new customer acquisition and are typically proactive (involving prospect targeting, contact and solicitation). Version numbering is used to track the impact of changes made to campaigns over their usage.",
    "example": "A prospect acquisition campaign is updated to provide amended/improved pricing terms that can be offered to targeted prospects poor take-up rate has been detected for the campaign",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "",
    "key_features": [
      {
        "name": "Define the target profile/impact of a campaign",
        "description": "Enables define the target profile/impact of a campaign to support design and refine prospect campaign specifications based on their impact",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Specify a prospect campaign",
        "description": "Enables specify a prospect campaign to support design and refine prospect campaign specifications based on their impact",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Track the impact of a campaign",
        "description": "Enables track the impact of a campaign to support design and refine prospect campaign specifications based on their impact",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Refine/reconfigure a campaign",
        "description": "Enables refine/reconfigure a campaign to support design and refine prospect campaign specifications based on their impact",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}