{
  "division": "Enterprise Enabling",
  "domain": "Task Management",
  "capability": {
    "name": "Delinquent Account Handling",
    "definition": "This service domain handles delinquent accounts (typically for active credit/charge cards) for follow-up of payments due through periodic review and contacts. This process ends when the account is cancelled and is transferred to Collections",
    "role": "This service domain determines and executes strategies for eliciting payment from high risk accounts. These strategies may include communicating with the customer through text messages, emails or phone calls. The account may continue to maintain some facilities at this stage. Eventually it can be necessary to reduce the credit line or block the account to prevent further increase in risk, or to cancel the account and transfer it to Collections.",
    "example": "When a Card Account is assessed to be at a high risk of default, such as a Charge Card Account with high out of pattern outstandings or a Credit Card Account with significant aged balances, attempts are made to elicit the payment of the outstanding amounts or to limit further increase in risk through optimal strategies for contacting the customer and inducing payment of the outstanding amount.",
    "status": "Inactive",
    "pattern": {},
    "core_systems": [],
    "api_bian_link": "https://app.swaggerhub.com/apis/BIAN-3/DelinquentAccountHandling/12.0.0",
    "key_features": [
      {
        "name": "Delinquent account assessment",
        "description": "Enables delinquent account assessment to support this service domain handles delinquent accounts (typically for active credit/charge cards) for follow-up of payments due through periodic review and contacts",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Account owner contact",
        "description": "Enables account owner contact to support this service domain handles delinquent accounts (typically for active credit/charge cards) for follow-up of payments due through periodic review and contacts",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Account payment processing",
        "description": "Enables account payment processing to support this service domain handles delinquent accounts (typically for active credit/charge cards) for follow-up of payments due through periodic review and contacts",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      },
      {
        "name": "Delinquent account resolution (re-instated or passed to collections)",
        "description": "Enables delinquent account resolution (re-instated or passed to collections) to support this service domain handles delinquent accounts (typically for active credit/charge cards) for follow-up of payments due through periodic review and contacts",
        "type": "Manual",
        "mode": "Active",
        "it_mappings": []
      }
    ],
    "business_objects": [],
    "process_links": [],
    "impact_analysis": {
      "note": ""
    }
  }
}